In [2]:
import pandas as pd
import numpy as np

from sqlalchemy import create_engine

In [3]:
data = pd.read_csv('C:/Users/ryana/Documents/Github/2023-Tourist-Arrivals-Philippines/dataset/2023_Tourist_Arrivals_in_the_Philippines.csv')
data.head(5)

,rank,country,january,february,march,april,may,june,july,august,september,october,total,share
0,NaN,Grand Total,"464,168","466,032","475,643","458,083","389,288","448,867","516,304","437,648","382,346","406,901","4,445,280",100.00%
1,NaN,* Overseas Filipinos,"38,980","34,337","39,351","40,763","36,195","41,657","48,385","33,619","26,046","28,778","368,111",8.28%
2,NaN,Foreign Tourists,"425,188","431,695","436,292","417,320","353,093","407,210","467,919","404,029","356,300","378,123","4,077,169",91.72%
3,1,SOUTH KOREA,"126,263","126,692","106,744","94,217","98,433","116,414","139,528","134,346","113,772","114,089","1,170,498",26.33%
4,2,UNITED STATES OF AMERICA,"87,440","85,917","80,284","75,830","71,249","93,597","85,918","52,452","50,188","59,420","742,295",16.70%

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 253 entries, 0 to 252
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rank       247 non-null    object
 1   country    252 non-null    object
 2   january    250 non-null    object
 3   february   250 non-null    object
 4   march      250 non-null    object
 5   april      250 non-null    object
 6   may        250 non-null    object
 7   june       250 non-null    object
 8   july       251 non-null    object
 9   august     251 non-null    object
 10  september  252 non-null    object
 11  october    252 non-null    object
 12  total      252 non-null    object
 13  share      250 non-null    object
dtypes: object(14)
memory usage: 27.8+ KB

## Preprocessing

In [5]:
cleaned_data = data.iloc[3:,1:].reset_index(drop=True)
cleaned_data.head(3)

,country,january,february,march,april,may,june,july,august,september,october,total,share
0,SOUTH KOREA,"126,263","126,692","106,744","94,217","98,433","116,414","139,528","134,346","113,772","114,089","1,170,498",26.33%
1,UNITED STATES OF AMERICA,"87,440","85,917","80,284","75,830","71,249","93,597","85,918","52,452","50,188","59,420","742,295",16.70%
2,JAPAN,"15,178","23,013","26,356","23,655","21,179","19,676","27,148","38,929","27,866","24,674","247,674",5.57%

### Null Values and Standardize Format

**Objectives:**
- Replace null values to 0
- Standardize numeric and string formats
- Convert datatype into integer or float for numeric columns

**Numeric columns**

In [6]:
cleaned_data = cleaned_data.replace('-', np.nan).replace(r',','',regex=True).fillna(0)

cleaned_data['share'] = cleaned_data['share'].replace(r'%','', regex=True).astype(float)

to_int = cleaned_data.iloc[:,1:12].columns
for column in to_int:
    cleaned_data[column] = cleaned_data[column].astype(int)

In [7]:
diff = cleaned_data.iloc[:,1:11].sum(axis=1) - cleaned_data['total']
diff.sum() # should be 0 if all totals are correct

np.int64(0)

**String columns**

In [8]:
cleaned_data['country'] = cleaned_data['country'].str.title().astype(str)

### Duplicate Values

There is no duplicate values

In [9]:
cleaned_data.duplicated().sum()

np.int64(0)

## Descriptive Statistics

In [10]:
cleaned_data.describe()

,january,february,march,april,may,june,july,august,september,october,total,share
count,250.000000,250.000000,250.000000,250.000000,250.000000,250.000000,250.000000,250.000000,250.000000,250.000000,2.500000e+02,250.000000
mean,1700.752000,1726.780000,1745.168000,1669.280000,1412.372000,1628.840000,1871.676000,1616.116000,1425.200000,1512.492000,1.630868e+04,0.366400
std,10090.403139,10071.091048,9058.526141,8369.324207,8096.849299,9818.256962,10951.374501,9805.124793,8402.686104,8646.164982,9.251852e+04,2.081307
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000e+00,0.000000
25%,2.000000,3.000000,3.000000,4.000000,2.250000,3.000000,3.000000,4.000000,4.000000,3.000000,3.275000e+01,0.000000
50%,16.500000,18.500000,18.000000,18.000000,14.500000,17.500000,16.000000,18.000000,20.000000,19.000000,1.730000e+02,0.000000
75%,180.000000,194.500000,237.250000,173.500000,134.750000,115.500000,139.250000,179.000000,160.500000,145.250000,1.587000e+03,0.037500
max,126263.000000,126692.000000,106744.000000,94217.000000,98433.000000,116414.000000,139528.000000,134346.000000,113772.000000,114089.000000,1.170498e+06,26.330000

## Import cleaned data to PostgreSQL Database

In [11]:
cleaned_data.to_csv('C:/Users/ryana/Documents/Github/2023-Tourist-Arrivals-Philippines/dataset/cleaned_tourist_arrivals_philippines.csv', index=False)

In [15]:
username = 'postgres'
password = 'gelo120601'

connection_string = f'postgresql://{username}:{password}@localhost/tourism'

db = create_engine(connection_string)
conn = db.connect()

cleaned_data.to_sql('tourist', con=conn, if_exists='replace', index=False)

250